# Pandas reference
https://learning.oreilly.com/library/view/python-for-data/9781449323592/ch05.html

In [23]:
import pandas as pd
import numpy as np
import seaborn as sns

In [28]:
%config IPCompleter.greedy=True

# Series

In [29]:
# Series is indexed ndarray.
a = pd.Series([1,1,2,3,5,8], index=['a','b','c','d','e','f'])
a.name = 'fib'
a.index.name = 'ind'
a

ind
a    1
b    1
c    2
d    3
e    5
f    8
Name: fib, dtype: int64

In [30]:
a[a>3]

ind
e    5
f    8
Name: fib, dtype: int64

In [31]:
# can access with index-name instead of index .. BUT WHY ?
a[['a','b']]

ind
a    1
b    1
Name: fib, dtype: int64

In [32]:
a.isnull()

ind
a    False
b    False
c    False
d    False
e    False
f    False
Name: fib, dtype: bool

In [33]:
a.index = np.arange(6) # reassign index.

In [34]:
a

0    1
1    1
2    2
3    3
4    5
5    8
Name: fib, dtype: int64

In [17]:
# create series from list/ndarray
a = pd.Series([1,2,3])
print(a)

a = pd.Series(np.arange(1,100,10))
print(type(a)); print(a)

# get ndarray from series - without index.
v = a.values
print(type(v), v)

0    1
1    2
2    3
dtype: int64
<class 'pandas.core.series.Series'>
0     1
1    11
2    21
3    31
4    41
5    51
6    61
7    71
8    81
9    91
dtype: int64
<class 'numpy.ndarray'> [ 1 11 21 31 41 51 61 71 81 91]

# Dataframe

In [35]:
# create dataframe from dict
d = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df = pd.DataFrame(d)
print(df.columns)
print(df.shape)
(nrows, ncols) = df.shape
print ('rows: ', nrows, 'cols: ', ncols)
display(df)

Index(['state', 'year', 'pop'], dtype='object')
(6, 3)
rows:  6 cols:  3

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [26]:
# each col in DF is Series
st = df['state'] # or st.state
print(type(st), st)

<class 'pandas.core.series.Series'> 0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [41]:
# access row by position
print (df.loc[3]) # df[3] won't work
print (st.loc[2], st[2]) # no need to use loc for series?

state    Nevada
year       2001
pop         2.4
Name: 3, dtype: object
Ohio Ohio

In [46]:
# create DF from arrays -- list of of lists basically
a =   [['Ohio', 2000, 1.5],
       ['Ohio', 2001, 1.7],
       ['Ohio', 2002, 3.6],
       ['Nevada', 2001, 2.4],
       ['Nevada', 2002, 2.9],
       ['Nevada', 2003, 3.2]]
df = pd.DataFrame(a, columns = ['State', 'Year', 'Population'])
display(df)

    State  Year  Population
0    Ohio  2000         1.5
1    Ohio  2001         1.7
2    Ohio  2002         3.6
3  Nevada  2001         2.4
4  Nevada  2002         2.9
5  Nevada  2003         3.2

In [47]:
# get array back
print (df.values)

[['Ohio' 2000 1.5]
 ['Ohio' 2001 1.7]
 ['Ohio' 2002 3.6]
 ['Nevada' 2001 2.4]
 ['Nevada' 2002 2.9]
 ['Nevada' 2003 3.2]]

In [49]:
# drop some elements in row - note 1 and 2 are missing in the index
df1 = df.drop([1,2])
display(df1)

    State  Year  Population
0    Ohio  2000         1.5
3  Nevada  2001         2.4
4  Nevada  2002         2.9
5  Nevada  2003         3.2

In [50]:
# drop a col. Axis 0 is row, 1 is col
df2 = df.drop('State', axis=1) # or axis='column'
display(df2)

   Year  Population
0  2000         1.5
1  2001         1.7
2  2002         3.6
3  2001         2.4
4  2002         2.9
5  2003         3.2

In [64]:
#filtering 
df1 = df[df.Population>3]
display (df1)
print(df1.iloc[1]) # integer location. Note that index 5 is in int-index 1.

# multiple conditions
df1 = df[(df.Year > 2002) & (df.Population > 3)]
display(df1)

    State  Year  Population
2    Ohio  2002         3.6
5  Nevada  2003         3.2

State         Nevada
Year            2003
Population       3.2
Name: 5, dtype: object

    State  Year  Population
5  Nevada  2003         3.2

In [78]:
# apply
df['PopPerc'] = df['Population'].apply(lambda x: 100.0*x/df['Population'].sum() ) # note - this is incorrect %.
display(df)

    State  Year  Population    PopPerc
0    Ohio  2000         1.5   9.803922
1    Ohio  2001         1.7  11.111111
2    Ohio  2002         3.6  23.529412
3  Nevada  2001         2.4  15.686275
4  Nevada  2002         2.9  18.954248
5  Nevada  2003         3.2  20.915033

In [79]:
print (df.Population.min(), df.Population.max(), df.Population.mean())

1.5 3.6 2.5500000000000003

## File IO

In [82]:
seindf = pd.read_csv('~/Dropbox/data/seinfeld/seinfeld.csv')
print(seindf.shape)
display(seindf.head(3))

(172, 5)

   Season  Episode           Title  Rating  Votes
0       1        2    The Stakeout     7.8    649
1       1        3     The Robbery     7.7    565
2       1        4  Male Unbonding     7.6    561

In [93]:
# write to file
import sys
df.to_csv('~/Dropbox/data/test/test.csv')
# print to sceen with custom seperator
df.to_csv(sys.stdout, sep=':', index=False, header=False)

Ohio:2000:1.5:9.80392156862745
Ohio:2001:1.7:11.11111111111111
Ohio:2002:3.6:23.52941176470588
Nevada:2001:2.4:15.686274509803921
Nevada:2002:2.9:18.954248366013072
Nevada:2003:3.2:20.915032679738562

In [95]:
df.to_json(sys.stdout)

{"State":{"0":"Ohio","1":"Ohio","2":"Ohio","3":"Nevada","4":"Nevada","5":"Nevada"},"Year":{"0":2000,"1":2001,"2":2002,"3":2001,"4":2002,"5":2003},"Population":{"0":1.5,"1":1.7,"2":3.6,"3":2.4,"4":2.9,"5":3.2},"PopPerc":{"0":9.8039215686,"1":11.1111111111,"2":23.5294117647,"3":15.6862745098,"4":18.954248366,"5":20.9150326797}}

# Sample usecase

In [35]:
df1 = pd.read_csv('/Users/nram/Jupyter/Data/CSV/pers-health-data-feb2021.csv')
df1.head(10)

            Timestamp       Date        Time  Who      What       Value
0  2/21/2021 21:00:18  2/20/2021  4:30:00 PM  Ram      Temp       100.4
1  2/21/2021 21:00:48  2/20/2021  9:00:00 AM  Sri      Temp       100.4
2  2/21/2021 21:01:37  2/21/2021  8:30:00 AM  Ram      Temp       101.8
3  2/21/2021 21:02:15  2/21/2021  9:30:00 AM  Sri      Temp       100.8
4  2/21/2021 21:03:13  2/21/2021  9:00:00 AM  Ram      SP02          93
5  2/21/2021 21:05:41  2/21/2021  4:00:00 PM  Sri      SP02          99
6  2/21/2021 21:06:24  2/21/2021  4:00:00 PM  Lia      SP02          99
7  2/21/2021 21:06:59  2/21/2021  8:30:00 AM  Ram  Medicine     Tylenol
8  2/21/2021 21:07:29  2/21/2021  4:00:00 PM  Ram  Medicine     Tylenol
9  2/21/2021 21:08:03  2/21/2021  4:00:00 PM  Ram  Medicine  Robitussin

In [36]:
df1['Who'].unique()

array(['Ram', 'Sri', 'Lia', 'Krithi'], dtype=object)

In [37]:
df2=df1[df1['What'].isin(['Temp', 'SP02'])]
df2

             Timestamp       Date         Time     Who  What  Value
0   2/21/2021 21:00:18  2/20/2021   4:30:00 PM     Ram  Temp  100.4
1   2/21/2021 21:00:48  2/20/2021   9:00:00 AM     Sri  Temp  100.4
2   2/21/2021 21:01:37  2/21/2021   8:30:00 AM     Ram  Temp  101.8
3   2/21/2021 21:02:15  2/21/2021   9:30:00 AM     Sri  Temp  100.8
4   2/21/2021 21:03:13  2/21/2021   9:00:00 AM     Ram  SP02     93
5   2/21/2021 21:05:41  2/21/2021   4:00:00 PM     Sri  SP02     99
6   2/21/2021 21:06:24  2/21/2021   4:00:00 PM     Lia  SP02     99
11  2/21/2021 21:21:31  2/21/2021   8:20:00 PM     Ram  Temp   99.2
12  2/21/2021 21:22:42  2/21/2021   8:20:00 PM     Ram  SP02     98
13   2/22/2021 3:18:30  2/22/2021   2:15:00 AM     Ram  Temp  100.1
14   2/22/2021 3:18:57  2/22/2021   2:15:00 AM     Ram  SP02     94
15   2/22/2021 3:28:56  2/22/2021   2:30:00 AM  Krithi  Temp   99.4
18  2/22/2021 12:33:31  2/22/2021  11:30:00 AM     Ram  SP02     97

In [38]:
df2['Value'] = df2['Value'].astype(float)
df2.dtypes
df2

<ipython-input-38-427b7d4de7af>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Value'] = df2['Value'].astype(float)

             Timestamp       Date         Time     Who  What  Value
0   2/21/2021 21:00:18  2/20/2021   4:30:00 PM     Ram  Temp  100.4
1   2/21/2021 21:00:48  2/20/2021   9:00:00 AM     Sri  Temp  100.4
2   2/21/2021 21:01:37  2/21/2021   8:30:00 AM     Ram  Temp  101.8
3   2/21/2021 21:02:15  2/21/2021   9:30:00 AM     Sri  Temp  100.8
4   2/21/2021 21:03:13  2/21/2021   9:00:00 AM     Ram  SP02   93.0
5   2/21/2021 21:05:41  2/21/2021   4:00:00 PM     Sri  SP02   99.0
6   2/21/2021 21:06:24  2/21/2021   4:00:00 PM     Lia  SP02   99.0
11  2/21/2021 21:21:31  2/21/2021   8:20:00 PM     Ram  Temp   99.2
12  2/21/2021 21:22:42  2/21/2021   8:20:00 PM     Ram  SP02   98.0
13   2/22/2021 3:18:30  2/22/2021   2:15:00 AM     Ram  Temp  100.1
14   2/22/2021 3:18:57  2/22/2021   2:15:00 AM     Ram  SP02   94.0
15   2/22/2021 3:28:56  2/22/2021   2:30:00 AM  Krithi  Temp   99.4
18  2/22/2021 12:33:31  2/22/2021  11:30:00 AM     Ram  SP02   97.0

In [39]:
df1.values

array([['2/21/2021 21:00:18', '2/20/2021', '4:30:00 PM', 'Ram', 'Temp',
        '100.4'],
       ['2/21/2021 21:00:48', '2/20/2021', '9:00:00 AM', 'Sri', 'Temp',
        '100.4'],
       ['2/21/2021 21:01:37', '2/21/2021', '8:30:00 AM', 'Ram', 'Temp',
        '101.8'],
       ['2/21/2021 21:02:15', '2/21/2021', '9:30:00 AM', 'Sri', 'Temp',
        '100.8'],
       ['2/21/2021 21:03:13', '2/21/2021', '9:00:00 AM', 'Ram', 'SP02',
        '93'],
       ['2/21/2021 21:05:41', '2/21/2021', '4:00:00 PM', 'Sri', 'SP02',
        '99'],
       ['2/21/2021 21:06:24', '2/21/2021', '4:00:00 PM', 'Lia', 'SP02',
        '99'],
       ['2/21/2021 21:06:59', '2/21/2021', '8:30:00 AM', 'Ram',
        'Medicine', 'Tylenol'],
       ['2/21/2021 21:07:29', '2/21/2021', '4:00:00 PM', 'Ram',
        'Medicine', 'Tylenol'],
       ['2/21/2021 21:08:03', '2/21/2021', '4:00:00 PM', 'Ram',
        'Medicine', 'Robitussin'],
       ['2/21/2021 21:08:47', '2/21/2021', '5:00:00 PM', 'Sri',
        'Medicine', 'Robitussin'],
       ['2/21/2021 21:21:31', '2/21/2021', '8:20:00 PM', 'Ram', 'Temp',
        '99.2'],
       ['2/21/2021 21:22:42', '2/21/2021', '8:20:00 PM', 'Ram', 'SP02',
        '98'],
       ['2/22/2021 3:18:30', '2/22/2021', '2:15:00 AM', 'Ram', 'Temp',
        '100.1'],
       ['2/22/2021 3:18:57', '2/22/2021', '2:15:00 AM', 'Ram', 'SP02',
        '94'],
       ['2/22/2021 3:28:56', '2/22/2021', '2:30:00 AM', 'Krithi', 'Temp',
        '99.4'],
       ['2/22/2021 3:29:30', '2/22/2021', '2:30:00 AM', 'Krithi',
        'Medicine', 'Tylenol'],
       ['2/22/2021 12:33:09', '2/22/2021', '2:30:00 AM', 'Krithi',
        'Medicine', 'Tylenol'],
       ['2/22/2021 12:33:31', '2/22/2021', '11:30:00 AM', 'Ram', 'SP02',
        '97']], dtype=object)

In [40]:
#df2['high'] = df2['Value'] > 100
#df2
#df2 = df2.drop(['high', 'High-fever', 'Grade'], axis=1)
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13 entries, 0 to 18
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Timestamp  13 non-null     object
 1   Date       13 non-null     object
 2   Time       13 non-null     object
 3   Who        13 non-null     object
 4   What       13 non-null     object
 5   Value      13 non-null     float64
dtypes: float64(1), object(5)
memory usage: 728.0+ bytes

In [41]:
df2['Grade'] = [ 'High' if x else 'Low' for x in df2['Value'] > 100 ]
df2
# this applies grade to all values - no good.

<ipython-input-41-31a34437d7d5>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Grade'] = [ 'High' if x else 'Low' for x in df2['Value'] > 100 ]

             Timestamp       Date         Time     Who  What  Value Grade
0   2/21/2021 21:00:18  2/20/2021   4:30:00 PM     Ram  Temp  100.4  High
1   2/21/2021 21:00:48  2/20/2021   9:00:00 AM     Sri  Temp  100.4  High
2   2/21/2021 21:01:37  2/21/2021   8:30:00 AM     Ram  Temp  101.8  High
3   2/21/2021 21:02:15  2/21/2021   9:30:00 AM     Sri  Temp  100.8  High
4   2/21/2021 21:03:13  2/21/2021   9:00:00 AM     Ram  SP02   93.0   Low
5   2/21/2021 21:05:41  2/21/2021   4:00:00 PM     Sri  SP02   99.0   Low
6   2/21/2021 21:06:24  2/21/2021   4:00:00 PM     Lia  SP02   99.0   Low
11  2/21/2021 21:21:31  2/21/2021   8:20:00 PM     Ram  Temp   99.2   Low
12  2/21/2021 21:22:42  2/21/2021   8:20:00 PM     Ram  SP02   98.0   Low
13   2/22/2021 3:18:30  2/22/2021   2:15:00 AM     Ram  Temp  100.1  High
14   2/22/2021 3:18:57  2/22/2021   2:15:00 AM     Ram  SP02   94.0   Low
15   2/22/2021 3:28:56  2/22/2021   2:30:00 AM  Krithi  Temp   99.4   Low
18  2/22/2021 12:33:31  2/22/2021  11:30:00 AM     Ram  SP02   97.0   Low

In [42]:
df2[df2['Who'] == 'Ram'].describe()

            Value
count    8.000000
mean    97.937500
std      3.117205
min     93.000000
25%     96.250000
50%     98.600000
75%    100.175000
max    101.800000

In [43]:
df1[['Who']].value_counts()

Who
Ram       11
Sri        4
Krithi     3
Lia        1
dtype: int64

In [44]:
df2.groupby('Who')['Value'].mean()

Who
Krithi     99.400000
Lia        99.000000
Ram        97.937500
Sri       100.066667
Name: Value, dtype: float64

In [45]:
df2['Value'].nlargest(3)

2    101.8
3    100.8
0    100.4
Name: Value, dtype: float64

In [46]:
df2['Temp_C'] = df2[df2['What']=='Temp'].Value.apply(lambda x: (x-32)*(5/9) )
df2

<ipython-input-46-79359182e067>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Temp_C'] = df2[df2['What']=='Temp'].Value.apply(lambda x: (x-32)*(5/9) )

,Timestamp,Date,Time,Who,What,Value,Grade,Temp_C
0,2/21/2021 21:00:18,2/20/2021,4:30:00 PM,Ram,Temp,100.4,High,38.000000
1,2/21/2021 21:00:48,2/20/2021,9:00:00 AM,Sri,Temp,100.4,High,38.000000
2,2/21/2021 21:01:37,2/21/2021,8:30:00 AM,Ram,Temp,101.8,High,38.777778
3,2/21/2021 21:02:15,2/21/2021,9:30:00 AM,Sri,Temp,100.8,High,38.222222
4,2/21/2021 21:03:13,2/21/2021,9:00:00 AM,Ram,SP02,93.0,Low,NaN
5,2/21/2021 21:05:41,2/21/2021,4:00:00 PM,Sri,SP02,99.0,Low,NaN
6,2/21/2021 21:06:24,2/21/2021,4:00:00 PM,Lia,SP02,99.0,Low,NaN
11,2/21/2021 21:21:31,2/21/2021,8:20:00 PM,Ram,Temp,99.2,Low,37.333333
12,2/21/2021 21:22:42,2/21/2021,8:20:00 PM,Ram,SP02,98.0,Low,NaN
13,2/22/2021 3:18:30,2/22/2021,2:15:00 AM,Ram,Temp,100.1,High,37.833333
14,2/22/2021 3:18:57,2/22/2021,2:15:00 AM,Ram,SP02,94.0,Low,NaN
15,2/22/2021 3:28:56,2/22/2021,2:30:00 AM,Krithi,Temp,99.4,Low,37.444444
18,2/22/2021 12:33:31,2/22/2021,11:30:00 AM,Ram,SP02,97.0,Low,NaN

In [47]:
df2

,Timestamp,Date,Time,Who,What,Value,Grade,Temp_C
0,2/21/2021 21:00:18,2/20/2021,4:30:00 PM,Ram,Temp,100.4,High,38.000000
1,2/21/2021 21:00:48,2/20/2021,9:00:00 AM,Sri,Temp,100.4,High,38.000000
2,2/21/2021 21:01:37,2/21/2021,8:30:00 AM,Ram,Temp,101.8,High,38.777778
3,2/21/2021 21:02:15,2/21/2021,9:30:00 AM,Sri,Temp,100.8,High,38.222222
4,2/21/2021 21:03:13,2/21/2021,9:00:00 AM,Ram,SP02,93.0,Low,NaN
5,2/21/2021 21:05:41,2/21/2021,4:00:00 PM,Sri,SP02,99.0,Low,NaN
6,2/21/2021 21:06:24,2/21/2021,4:00:00 PM,Lia,SP02,99.0,Low,NaN
11,2/21/2021 21:21:31,2/21/2021,8:20:00 PM,Ram,Temp,99.2,Low,37.333333
12,2/21/2021 21:22:42,2/21/2021,8:20:00 PM,Ram,SP02,98.0,Low,NaN
13,2/22/2021 3:18:30,2/22/2021,2:15:00 AM,Ram,Temp,100.1,High,37.833333
14,2/22/2021 3:18:57,2/22/2021,2:15:00 AM,Ram,SP02,94.0,Low,NaN
15,2/22/2021 3:28:56,2/22/2021,2:30:00 AM,Krithi,Temp,99.4,Low,37.444444
18,2/22/2021 12:33:31,2/22/2021,11:30:00 AM,Ram,SP02,97.0,Low,NaN

In [48]:
def canonicalize (X):
    # 1. sort columns by name = but why ?
    v = sorted(X.columns)
    Y = X[v].copy()
    
    # 2. rows are lexographically sorted
    Y.sort_values(by=v, inplace=True)
    
    # 3. sort row -- Isn't 2 and 3 conflicing? 
    Y.set_index([list(range(0, len(Y)))], inplace=True)
    return Y

df3 = canonicalize(df1)
df3

         Date         Time           Timestamp       Value      What     Who
0   2/20/2021   4:30:00 PM  2/21/2021 21:00:18       100.4      Temp     Ram
1   2/20/2021   9:00:00 AM  2/21/2021 21:00:48       100.4      Temp     Sri
2   2/21/2021   4:00:00 PM  2/21/2021 21:05:41          99      SP02     Sri
3   2/21/2021   4:00:00 PM  2/21/2021 21:06:24          99      SP02     Lia
4   2/21/2021   4:00:00 PM  2/21/2021 21:07:29     Tylenol  Medicine     Ram
5   2/21/2021   4:00:00 PM  2/21/2021 21:08:03  Robitussin  Medicine     Ram
6   2/21/2021   5:00:00 PM  2/21/2021 21:08:47  Robitussin  Medicine     Sri
7   2/21/2021   8:20:00 PM  2/21/2021 21:21:31        99.2      Temp     Ram
8   2/21/2021   8:20:00 PM  2/21/2021 21:22:42          98      SP02     Ram
9   2/21/2021   8:30:00 AM  2/21/2021 21:01:37       101.8      Temp     Ram
10  2/21/2021   8:30:00 AM  2/21/2021 21:06:59     Tylenol  Medicine     Ram
11  2/21/2021   9:00:00 AM  2/21/2021 21:03:13          93      SP02     Ram
12  2/21/2021   9:30:00 AM  2/21/2021 21:02:15       100.8      Temp     Sri
13  2/22/2021  11:30:00 AM  2/22/2021 12:33:31          97      SP02     Ram
14  2/22/2021   2:15:00 AM   2/22/2021 3:18:30       100.1      Temp     Ram
15  2/22/2021   2:15:00 AM   2/22/2021 3:18:57          94      SP02     Ram
16  2/22/2021   2:30:00 AM  2/22/2021 12:33:09     Tylenol  Medicine  Krithi
17  2/22/2021   2:30:00 AM   2/22/2021 3:28:56        99.4      Temp  Krithi
18  2/22/2021   2:30:00 AM   2/22/2021 3:29:30     Tylenol  Medicine  Krithi

In [49]:
# from long to wide format
# how to get Who as well in this ?? -- see below.
df3.pivot(index=['Timestamp','Date','Time','Who'],columns=['What'], values='Value')

What                                               Medicine SP02   Temp
Timestamp          Date      Time        Who
2/21/2021 21:00:18 2/20/2021 4:30:00 PM  Ram            NaN  NaN  100.4
2/21/2021 21:00:48 2/20/2021 9:00:00 AM  Sri            NaN  NaN  100.4
2/21/2021 21:01:37 2/21/2021 8:30:00 AM  Ram            NaN  NaN  101.8
2/21/2021 21:02:15 2/21/2021 9:30:00 AM  Sri            NaN  NaN  100.8
2/21/2021 21:03:13 2/21/2021 9:00:00 AM  Ram            NaN   93    NaN
2/21/2021 21:05:41 2/21/2021 4:00:00 PM  Sri            NaN   99    NaN
2/21/2021 21:06:24 2/21/2021 4:00:00 PM  Lia            NaN   99    NaN
2/21/2021 21:06:59 2/21/2021 8:30:00 AM  Ram        Tylenol  NaN    NaN
2/21/2021 21:07:29 2/21/2021 4:00:00 PM  Ram        Tylenol  NaN    NaN
2/21/2021 21:08:03 2/21/2021 4:00:00 PM  Ram     Robitussin  NaN    NaN
2/21/2021 21:08:47 2/21/2021 5:00:00 PM  Sri     Robitussin  NaN    NaN
2/21/2021 21:21:31 2/21/2021 8:20:00 PM  Ram            NaN  NaN   99.2
2/21/2021 21:22:42 2/21/2021 8:20:00 PM  Ram            NaN   98    NaN
2/22/2021 12:33:09 2/22/2021 2:30:00 AM  Krithi     Tylenol  NaN    NaN
2/22/2021 12:33:31 2/22/2021 11:30:00 AM Ram            NaN   97    NaN
2/22/2021 3:18:30  2/22/2021 2:15:00 AM  Ram            NaN  NaN  100.1
2/22/2021 3:18:57  2/22/2021 2:15:00 AM  Ram            NaN   94    NaN
2/22/2021 3:28:56  2/22/2021 2:30:00 AM  Krithi         NaN  NaN   99.4
2/22/2021 3:29:30  2/22/2021 2:30:00 AM  Krithi     Tylenol  NaN    NaN

In [50]:
# merging DF on common colounms
dfa = pd.DataFrame({'A1': ['a','b','c'],
                   'A2' : [1,2,3]})

dfb = pd.DataFrame({'A1': ['b','c','d','e'],
                   'B2' : [100,200,300,400]})

print("-- dfa --")
display(dfa)

print ('-- dfb --')
display(dfb)

print ('-- merge (default: inner) --')
display(dfa.merge(dfb))

print ('-- merge left -- ')
display(dfa.merge(dfb,how='left',on='A1'))
                  
print ('-- merge right --')
display(dfa.merge(dfb,how='right',on='A1'))

print ('-- merge inner ---')                 
display(dfa.merge(dfb,how='inner',on='A1'))

print ('-- merge outer ---')                 
display(dfa.merge(dfb,how='outer',on='A1'))

-- dfa --

  A1  A2
0  a   1
1  b   2
2  c   3

-- dfb --

  A1   B2
0  b  100
1  c  200
2  d  300
3  e  400

-- merge (default: inner) --

  A1  A2   B2
0  b   2  100
1  c   3  200

-- merge left --

  A1  A2     B2
0  a   1    NaN
1  b   2  100.0
2  c   3  200.0

-- merge right --

  A1   A2   B2
0  b  2.0  100
1  c  3.0  200
2  d  NaN  300
3  e  NaN  400

-- merge inner ---

  A1  A2   B2
0  b   2  100
1  c   3  200

-- merge outer ---

  A1   A2     B2
0  a  1.0    NaN
1  b  2.0  100.0
2  c  3.0  200.0
3  d  NaN  300.0
4  e  NaN  400.0

In [51]:
dfa = pd.DataFrame({'A1': ['a','b'],
                   'A2' : [1,2]})

dfb = pd.DataFrame({'B1': ['b','c'],
                    'B2' : [100,200]})

dfa.merge(dfb, left_on='A1', right_on='B1', how='outer')

    A1   A2   B1     B2
0    a  1.0  NaN    NaN
1    b  2.0    b  100.0
2  NaN  NaN    c  200.0

In [52]:
dfa = pd.DataFrame({'A1': ['a','b','c'],
                   'A2' : [1,2,3]})

dfb = pd.DataFrame({ 'A1': ['a','c','b'],
                    'A2' : [1,3,2]})

dfb_s = canonicalize (dfb)

display(dfa, dfb, dfb_s)
#print(v)
dfa.equals(dfb)

  A1  A2
0  a   1
1  b   2
2  c   3

  A1  A2
0  a   1
1  c   3
2  b   2

  A1  A2
0  a   1
1  b   2
2  c   3

False

## Melting

In [53]:
# melting DF - make wide -> narrow
df_w = pd.DataFrame({'A1': ['a','b','c'],
                   'V2' : [1,2,3],
                   'V3' : [11,22,33],
                   'V4': [21,22,23]})

c = df_w.columns
cl = list(c)
v = ['V2','V3','V4']
[ cl.remove(x) for x in v ] 
print (f' columns: {c}\n id_vars: {cl}\n value_vars: {v}')

df_n = df_w.melt(id_vars=cl,
                value_vars = v,
                var_name='VAR',
                value_name='VAL')

display(df_w, df_n)

 columns: Index(['A1', 'V2', 'V3', 'V4'], dtype='object')
 id_vars: ['A1']
 value_vars: ['V2', 'V3', 'V4']

  A1  V2  V3  V4
0  a   1  11  21
1  b   2  22  22
2  c   3  33  23

  A1 VAR  VAL
0  a  V2    1
1  b  V2    2
2  c  V2    3
3  a  V3   11
4  b  V3   22
5  c  V3   33
6  a  V4   21
7  b  V4   22
8  c  V4   23

In [54]:
#from 
#https://www.youtube.com/watch?v=kJsiiPK5sxs
#https://github.com/knathanieltucker/pandas-tutorial/blob/master/notebooks/Row-Column%20Transformations.ipynb
    
tips = sns.load_dataset('tips')
tips.head(3)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

## Group by

In [55]:
tips_gb = tips.groupby(['day', 'sex']).agg({'size' : 'sum'})
tips_gb

             size
day  sex
Thur Male      73
     Female    79
Fri  Male      21
     Female    19
Sat  Male     156
     Female    63
Sun  Male     163
     Female    53

In [56]:
#tibs_gb2 = tips_gb.pivot(columns=['sex'], values='size')
#tips_gb2
tips_gb1 = tips_gb.unstack()
tips_gb1
#tips_gb1['size', 'Male'] <-- access multi index col.

     size
sex  Male Female
day
Thur   73     79
Fri    21     19
Sat   156     63
Sun   163     53

In [57]:
# flatten multi index col names 
tips_gb1.columns = ['__'.join(col).strip() for col in tips_gb1.columns.values]
tips_gb1

      size__Male  size__Female
day
Thur          73            79
Fri           21            19
Sat          156            63
Sun          163            53

In [58]:
tips_gb1['mf_ratio'] = tips_gb1.size__Male / tips_gb1.size__Female
tips_gb1

      size__Male  size__Female  mf_ratio
day
Thur          73            79  0.924051
Fri           21            19  1.105263
Sat          156            63  2.476190
Sun          163            53  3.075472

In [59]:
tips_gb2 = tips_gb.unstack(0)
tips_gb2

       size
day    Thur Fri  Sat  Sun
sex
Male     73  21  156  163
Female   79  19   63   53

In [60]:
tips_gb2.columns = ['__'.join(col).strip() for col in tips_gb2.columns.values]
tips_gb2

        size__Thur  size__Fri  size__Sat  size__Sun
sex
Male            73         21        156        163
Female          79         19         63         53

In [61]:
df1 = pd.DataFrame({'first': ['John', 'Mary'],
                        'last': ['Doe', 'Bo'],
                        'height': [5.5, 6.0],
                        'weight': [130, 150]})
df1

  first last  height  weight
0  John  Doe     5.5     130
1  Mary   Bo     6.0     150

In [62]:
# melting can be done with stacking
df1.melt(id_vars=['first', 'last'])

  first last variable  value
0  John  Doe   height    5.5
1  Mary   Bo   height    6.0
2  John  Doe   weight  130.0
3  Mary   Bo   weight  150.0

In [63]:
#samething with stack
df1.set_index(['first', 'last'], inplace=True)
df1.stack().reset_index()

  first last level_2      0
0  John  Doe  height    5.5
1  John  Doe  weight  130.0
2  Mary   Bo  height    6.0
3  Mary   Bo  weight  150.0

In [64]:
def filterdata(data, low, high):
    ###
    ### YOUR CODE HERE
    ###
    df = pd.DataFrame(data, columns=['price', 'city'])
    # multiple conditions. (condition1) & (condition)
    df1 = df[(df['price'] >= low) & (df['price'] <= high)]
    
    # convert df to list
    o = df1.values.tolist()
    print (f'ret {len(o)} results')
    
    #print (o[0:10])
    #print('values', df1.values.tolist())
    return (o)

In [78]:
# adding row to dataframe
df = pd.DataFrame(np.array([[1,2], [3, 4], [4, 5]]), 
                  columns = ['A', 'B'])
print ('--- dataframe')
print(df.shape)
display(df)

data =  [10, 11]
print (f'adding {data}')
s = pd.Series(data, index = df.columns)
df = df.append(s, ignore_index = True)

print ('-- modified dataframe')
print(df.shape)
display(df)

--- dataframe
(3, 2)

   A  B
0  1  2
1  3  4
2  4  5

adding [10, 11]
-- modified dataframe
(4, 2)

    A   B
0   1   2
1   3   4
2   4   5
3  10  11

In [85]:
# Iterating over rows in DF
# NOTE - THIS IS NOT RECOMMENDED and considered an anti-pattern
for i, r in df.iterrows ():
    print(f'--- i: {i} type(row): {type(r)}')
    display(r)

--- i: 0 type(row): <class 'pandas.core.series.Series'>

A    1
B    2
Name: 0, dtype: int64

--- i: 1 type(row): <class 'pandas.core.series.Series'>

A    3
B    4
Name: 1, dtype: int64

--- i: 2 type(row): <class 'pandas.core.series.Series'>

A    4
B    5
Name: 2, dtype: int64

--- i: 3 type(row): <class 'pandas.core.series.Series'>

A    10
B    11
Name: 3, dtype: int64

In [65]:

    print (f'tally_gaps got {len(votes_gap)} entries')
    #pp.pprint(votes_gap[0:2])
    df = pd.DataFrame(votes_gap)
    r = re.compile('(\d{4})-(\d{2})-(\d{2})')

    df['year'] = df.apply( lambda x : r.match(x['date']).group(1), axis = 1 )
    df1 = df[['gap', 'year']]
    df1['year'] = df1['year'].astype(int)
    df1 = df1.groupby(by=["year"], dropna=False).mean()
    df1 = df1.reset_index().values

    display(df1.head(3))

    o = df1.reset_index().values
    print(f'out {o}')
    return o

NameError: name 'votes_gap' is not defined

# sample dataset

In [1]:
# Import seaborn
import seaborn as sns
# Check out available datasets
print(sns.get_dataset_names())

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'exercise', 'flights', 'fmri', 'gammas', 'geyser', 'iris', 'mpg', 'penguins', 'planets', 'tips', 'titanic']
/opt/anaconda3/lib/python3.7/site-packages/seaborn/utils.py:384: UserWarning: No parser was explicitly specified, so I'm using the best available HTML parser for this system ("lxml"). This usually isn't a problem, but if you run this code on another system, or in a different virtual environment, it may use a different parser and behave differently.

The code that caused this warning is on line 384 of the file /opt/anaconda3/lib/python3.7/site-packages/seaborn/utils.py. To get rid of this warning, pass the additional argument 'features="lxml"' to the BeautifulSoup constructor.

  gh_list = BeautifulSoup(http)

In [29]:
mpg_df = sns.load_dataset('mpg')
print(mpg_df.shape)
display(mpg_df.head(3))
mpg_df.describe()

(398, 9)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000
25%,17.500000,4.000000,104.250000,75.000000,2223.750000,13.825000,73.000000
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000
75%,29.000000,8.000000,262.000000,126.000000,3608.000000,17.175000,79.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000

In [30]:
id_vars = ['name']
val_vars = ['mpg', 'cylinders', 'origin']
mpg_narrow_df = pd.melt(mpg_df, id_vars = id_vars, value_vars = val_vars)
mpg_narrow_df

                           name variable   value
0     chevrolet chevelle malibu      mpg      18
1             buick skylark 320      mpg      15
2            plymouth satellite      mpg      18
3                 amc rebel sst      mpg      16
4                   ford torino      mpg      17
...                         ...      ...     ...
1189            ford mustang gl   origin     usa
1190                  vw pickup   origin  europe
1191              dodge rampage   origin     usa
1192                ford ranger   origin     usa
1193                 chevy s-10   origin     usa

[1194 rows x 3 columns]